app/controllers/school_classes_controller.rb

	def create
		school_class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Science"], ["room_number", 13], ["created_at", "2020-03-17 20:04:17.199268"], ["updated_at", "2020-03-17 20:04:17.199268"]]

	def update
		school_class = get_school_class
		school_class.update(school_class_params)
---
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 18], ["updated_at", "2020-03-17 20:05:49.037627"], ["id", 1]]