app/controllers/students_controller.rb

	def create
		student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Ben"], ["last_name", "Hickson"], ["created_at", "2020-03-17 18:53:38.753391"], ["updated_at", "2020-03-17 18:53:38.753391"]]

	def update
		student = get_student
		student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Sonia"], ["last_name", "Laamoui"], ["updated_at", "2020-03-17 18:55:39.915746"], ["id", 1]]